In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'one' : pd.Series(np.random.randn(3), index=['a', 'b', 'c']), 'two' : pd.Series(np.random.randn(4),
            index=['a', 'b', 'c', 'd']), 'three' : pd.Series(np.random.randn(3), index=['b', 'c','d'])})

In [3]:
df

        one     three       two
a  0.130105       NaN  0.474264
b  1.651042  0.208724 -1.037608
c -1.220117  1.211255  0.480275
d       NaN -1.236525  0.412094

In [4]:
row = df.iloc[1]
row

one      1.651042
three    0.208724
two     -1.037608
Name: b, dtype: float64

In [5]:
df[::-1]

        one     three       two
d       NaN -1.236525  0.412094
c -1.220117  1.211255  0.480275
b  1.651042  0.208724 -1.037608
a  0.130105       NaN  0.474264

In [6]:
df.iloc[:2]

        one     three       two
a  0.130105       NaN  0.474264
b  1.651042  0.208724 -1.037608

In [9]:
df.iloc[1:2,1:2]

      three
b  0.208724

In [11]:
df.iloc[[1,2],[1,2]]

      three       two
b  0.208724 -1.037608
c  1.211255  0.480275

In [12]:
df.iloc[:,1:2]

      three
a       NaN
b  0.208724
c  1.211255
d -1.236525

In [13]:
column = df['two']

In [14]:
column

a    0.474264
b   -1.037608
c    0.480275
d    0.412094
Name: two, dtype: float64

In [15]:
df.sub(row, axis="columns")

        one     three       two
a -1.520937       NaN  1.511873
b  0.000000  0.000000  0.000000
c -2.871159  1.002532  1.517884
d       NaN -1.445249  1.449702

In [16]:
df.sub(row, axis= 1)

        one     three       two
a -1.520937       NaN  1.511873
b  0.000000  0.000000  0.000000
c -2.871159  1.002532  1.517884
d       NaN -1.445249  1.449702

In [17]:
df1 = df.copy()

In [18]:
#missing values use fill_values
df + df1

        one     three       two
a  0.260210       NaN  0.948529
b  3.302085  0.417447 -2.075217
c -2.440233  2.422511  0.960550
d       NaN -2.473050  0.824188

In [19]:
df.add(df1, fill_value=0)

        one     three       two
a  0.260210       NaN  0.948529
b  3.302085  0.417447 -2.075217
c -2.440233  2.422511  0.960550
d       NaN -2.473050  0.824188

In [20]:
#flexible operators
df.ne(df1)

     one  three    two
a  False   True  False
b  False  False  False
c  False  False  False
d   True  False  False

In [21]:
df.gt(df1)

     one  three    two
a  False  False  False
b  False  False  False
c  False  False  False
d  False  False  False

In [22]:
#boolean operations
(df > 0).all()

one      False
three    False
two      False
dtype: bool

In [23]:
(df1 < 0).any()

one      True
three    True
two      True
dtype: bool

In [24]:
(df >0).any().any()

True

In [25]:
#comparig object like operators
(df+df == df1 *2).any()

one      True
three    True
two      True
dtype: bool